Revit 2024 API
IFCLegacyStairOrRamp Members
The IFCLegacyStairOrRamp type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the IFCLegacyStairOrRamp
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBoundaryLines
 Gets boundary lines.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLandingGeometries
 Gets the geometries of landings.
GetNumberOfRisers
 Gets the number of risers.
GetNumberOfTreads
 Gets the number of treads.
GetRunGeometries
 Gets the geometries of runs.
GetStringerGeometries
 Gets the geometries of stringers.
GetTreadsLength
 Gets the length of treads.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetWalkLines
 Gets walk lines.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsRamp
 True if it is a ramp, false if it is a stair.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
RiserHeight
 The height of riser.
See Also
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace